# Задача 2
# Найдите сумму цифр трехзначного числа.

a = '123'
b = int(a[0])
c = int(a[1])
d = int(a[2])
print(b + c + d)
